app/views/internships/_form.html.erb

    <%= f.label :graduation_id %>
    <%= f.select :graduation_id, Graduation.all.collect { |c| [ c.name, c.id ] }, class:" browser-default", include_blank: true %>
---
SELECT "graduations".* FROM "graduations"