app/controllers/internships_controller.rb

  def index
    @internships = Internship.where(user_company: current_user_company)
---
SELECT "internships".* FROM "internships" WHERE "internships"."user_company_id" = 1